#+title: Build your own envoy control plane

process as I move through this video: https://www.youtube.com/watch?v=qAuq4cKEG_E

* Fork and clone go control plane

#+BEGIN_SRC shell :dir ~/Projects/envoy
git clone git@github.com:zachmandeville/go-control-plane.git
#+END_SRC

#+RESULTS:

#+BEGIN_SRC shell :dir ~/Projects/envoy/go-control-plane :results output
tree -L 2
#+END_SRC

#+RESULTS:
#+begin_example
.
├── CHANGELOG.md
├── CONTRIBUTING.md
├── Dockerfile.ci
├── LICENSE
├── Makefile
├── OWNERS.md
├── README.md
├── build
│   ├── coverage.sh
│   ├── example.sh
│   ├── integration.sh
│   └── run_docker.sh
├── docs
│   ├── README.md
│   └── cache
├── envoy
│   ├── COMMIT
│   ├── admin
│   ├── annotations
│   ├── api
│   ├── config
│   ├── data
│   ├── extensions
│   ├── service
│   ├── type
│   └── watchdog
├── examples
│   └── dyplomat
├── go.mod
├── go.sum
├── internal
│   ├── example
│   └── upstream
├── pkg
│   ├── cache
│   ├── conversion
│   ├── integration
│   ├── log
│   ├── resource
│   ├── server
│   ├── test
│   ├── ttl
│   └── wellknown
├── sample
│   ├── bootstrap-ads.yaml
│   ├── bootstrap-adsv3.yaml
│   ├── bootstrap-rest.yaml
│   ├── bootstrap-restv3.yaml
│   ├── bootstrap-xds.yaml
│   └── bootstrap-xdsv3.yaml
├── scripts
│   ├── check_version_dirty.sh
│   ├── create_version.sh
│   └── export.sh
└── support
    ├── README.md
    ├── bootstrap
    └── hooks

32 directories, 26 files
#+end_example

* Fork and clone sample xds server
This is using the simple State-of-the-World style, where everytime there is a
change we send envoy the complete config at that point in time (or the current
state of the world) and it updates accordingly. Compare this to incremental, or
delta xDS, that only sends what's changed.

We are also going with the simple single stream per type. This is just to learn
it. For our own purposes, we want to implement an [[file:20210322142924-ads.org][ADS]] server. This will be good
to show it is working and that we have working systems on this machine.

#+BEGIN_SRC shell :dir ~/Projects/envoy/ :results silent
git clone git@github.com:zachmandeville/envoy-xds-server.git
#+END_SRC

#+BEGIN_SRC shell :dir ~/Projects/envoy/envoy-xds-server :results output
tree -L 2
#+END_SRC

#+RESULTS:
#+begin_example
.
├── Dockerfile
├── Makefile
├── README.md
├── apis
│   └── v1alpha1
├── cmd
│   └── server
├── go.mod
├── go.sum
├── hack
│   ├── bootstrap.yaml
│   └── start-envoy.sh
└── internal
    ├── processor
    ├── resources
    ├── server
    ├── watcher
    └── xdscache

11 directories, 7 files
#+end_example

The heart of the file is in ~cmd/server/main.go~ which we will look at in more detail later.

* Test it out

With envoy running, we can now ping localhost:9000 and get a response from one of our echo servers.

#+begin_src shell :results output
curl localhost:9000
#+end_src

#+RESULTS:
#+begin_example
ECHO Request Server:
--------------------
App:
    Sample-Endpoint!
Host:
    30a2a938d729
Request:
    http://localhost:9000/
Headers:
    map[Accept:[*/*] Content-Length:[0] User-Agent:[curl/7.64.1] X-Envoy-Expected-Rq-Timeout-Ms:[15000] X-Forwarded-Proto:[http] X-Request-Id:[026d1105-65d1-44dd-8a34-81023e9f5111]]
#+end_example

What is more exciting is when you ping over and over, as we can see that the host will change between the two echo endpoints we set.

#+NAME: curl :9000 over and over
#+begin_src tmate :window testing
while sleep 1; do
    curl -i http://localhost:9000
done
#+end_src

For me it wavers between host 30a.... and 2ec...

I will adjust the config, and remove one of the endpoints, so it'd look like

#+NAME: Initial xDS Server Config
#+begin_src yaml :tangle ~/Projects/envoy/envoy-xds-server/config/config.yaml
name: z_config
spec:
  listeners:
  - name: listener_0
    address: 0.0.0.0
    port: 9000
    routes:
    - name: echoroute
      prefix: /
      clusters:
      - echo
  clusters:
  - name: echo
    endpoints:
    - address: 0.0.0.0
      port: 9101
    # - address: 0.0.0.0
    #   port: 9102
#+end_src

and check the output in the tmate window, there is now only a single host being returned.
